simplecube-solarload/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(

    (0 0 0)
    (2 0 0)
    (2 1 0)
    (0 1 0)

    (0 0 1)
    (2 0 1)
    (2 1 1)
    (0 1 1)

);                     

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 15 15) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    plusx
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    plusy
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    plusz
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    minx
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    miny
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    minz
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
);

// ************************************************************************* //
