simplecube-solarload/constant/space/viewFactorsDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object viewFactorsDict;
}

writeViewFactorMatrix yes;
writeFacesAgglomeration yes;
writePatchViewFactors no;
debug 1; 	//- Dump connectivity rays

dumpRays no;
".*"
{
  nFacesInCoarsestLevel 100;
  featureAngle 30; 	// increase to get more radiation patches (coarse faces)// 0: one radiation patch (coarse face) over one cell face
} 	//- Maximum length for dynamicList. See /applications/utilities/preProcessing/viewFactorsGen/shootRays.H

maxDynListLength 1000000000; 	// ************************************************************************* //

plusy
{
  featureAngle 30;
  nFacesInCoarsestLevel 20;
}

plusz
{
  featureAngle 30;
  nFacesInCoarsestLevel 20;
}

minx
{
  featureAngle 30;
  nFacesInCoarsestLevel 20;
}

miny
{
  featureAngle 30;
  nFacesInCoarsestLevel 20;
}

minz
{
  featureAngle 30;
  nFacesInCoarsestLevel 20;
}

space_to_cube
{
  featureAngle 30;
  nFacesInCoarsestLevel 20;
}

