simplecube-solarload/0.orig/qr
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      qr;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 0 -3 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{

    #includeEtc "caseDicts/setConstraintTypes"


    ".*"
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
