simplecube-solarload/system/surfaceFeatureExtractDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object surfaceFeatureExtractDict;
}

inputflux.stl
{
  extractionMethod extractFromSurface;
  includedAngle 150;
  writeFeatureEdgeMesh yes;
  writeObj yes;
}

sphere.stl
{
  extractionMethod extractFromSurface;
  includedAngle 150;
  writeFeatureEdgeMesh yes;
  writeObj yes;
}

